GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32g5x3q(e)xx-pinctrl.h
/* I2C2_SDA */
#define I2C2_SDA_PB5 \
	GD32_PINMUX_AF('B', 5, AF8)
#define I2C2_SDA_PC9 \
	GD32_PINMUX_AF('C', 9, AF8)
#define I2C2_SDA_PC11 \
	GD32_PINMUX_AF('C', 11, AF8)
#define I2C2_SDA_PF4 \
	GD32_PINMUX_AF('F', 4, AF4)
#define I2C2_SDA_PG8 \
	GD32_PINMUX_AF('G', 8, AF4)

/* I2C2_SMBA */
#define I2C2_SMBA_PA9 \
	GD32_PINMUX_AF('A', 9, AF2)
#define I2C2_SMBA_PB2 \
	GD32_PINMUX_AF('B', 2, AF4)
#define I2C2_SMBA_PG6 \
	GD32_PINMUX_AF('G', 6, AF4)

/* I2C3_SCL */
#define I2C3_SCL_PA13 \
	GD32_PINMUX_AF('A', 13, AF3)
#define I2C3_SCL_PC6 \
	GD32_PINMUX_AF('C', 6, AF8)
#define I2C3_SCL_PF14 \
	GD32_PINMUX_AF('F', 14, AF4)
#define I2C3_SCL_PG3 \
	GD32_PINMUX_AF('G', 3, AF4)

/* I2C3_SDA */
#define I2C3_SDA_PB7 \
	GD32_PINMUX_AF('B', 7, AF3)
#define I2C3_SDA_PC7 \
	GD32_PINMUX_AF('C', 7, AF8)
#define I2C3_SDA_PF15 \
	GD32_PINMUX_AF('F', 15, AF4)
#define I2C3_SDA_PG4 \
	GD32_PINMUX_AF('G', 4, AF4)

/* I2C3_SMBA */
#define I2C3_SMBA_PA14 \
	GD32_PINMUX_AF('A', 14, AF3)
#define I2C3_SMBA_PD11 \
	GD32_PINMUX_AF('D', 11, AF4)
#define I2C3_SMBA_PF13 \
	GD32_PINMUX_AF('F', 13, AF4)

/* IFRP_OUT */
#define IFRP_OUT_PA13 \
	GD32_PINMUX_AF('A', 13, AF5)
#define IFRP_OUT_PB9 \
	GD32_PINMUX_AF('B', 9, AF5)

/* JTCK */
#define JTCK_PA14 \
	GD32_PINMUX_AF('A', 14, AF0)

/* JTDI */
#define JTDI_PA15 \
	GD32_PINMUX_AF('A', 15, AF0)

/* JTDO */
#define JTDO_PB3 \
	GD32_PINMUX_AF('B', 3, AF0)

/* JTMS */
#define JTMS_PA13 \
	GD32_PINMUX_AF('A', 13, AF0)

/* LPTIMER_ETI0 */
#define LPTIMER_ETI0_PB6 \
	GD32_PINMUX_AF('B', 6, AF11)
#define LPTIMER_ETI0_PC3 \
	GD32_PINMUX_AF('C', 3, AF1)

/* LPTIMER_IN0 */
#define LPTIMER_IN0_PB5 \
	GD32_PINMUX_AF('B', 5, AF11)
#define LPTIMER_IN0_PC0 \
	GD32_PINMUX_AF('C', 0, AF1)

/* LPTIMER_IN1 */
#define LPTIMER_IN1_PB7 \
	GD32_PINMUX_AF('B', 7, AF11)
#define LPTIMER_IN1_PC2 \
	GD32_PINMUX_AF('C', 2, AF1)

/* LPTIMER_OUT */
#define LPTIMER_OUT_PA14 \
	GD32_PINMUX_AF('A', 14, AF1)
#define LPTIMER_OUT_PB2 \
	GD32_PINMUX_AF('B', 2, AF1)
#define LPTIMER_OUT_PC1 \
	GD32_PINMUX_AF('C', 1, AF1)

/* LSCK_OUT */
#define LSCK_OUT_PA2 \
	GD32_PINMUX_AF('A', 2, ANALOG)

/* LVD_IN */
#define LVD_IN_PA10 \
	GD32_PINMUX_AF('A', 10, ANALOG)

/* NJTRST */
#define NJTRST_PB4 \
	GD32_PINMUX_AF('B', 4, AF0)

/* NMI */
#define NMI_PA8 \
	GD32_PINMUX_AF('A', 8, ANALOG)

/* OSC32IN */
#define OSC32IN_PC14 \
	GD32_PINMUX_AF('C', 14, ANALOG)

/* OSC32OUT */
#define OSC32OUT_PC15 \
	GD32_PINMUX_AF('C', 15, ANALOG)

/* OSCIN */
#define OSCIN_PF0 \
	GD32_PINMUX_AF('F', 0, ANALOG)

/* OSCOUT */
#define OSCOUT_PF1 \
	GD32_PINMUX_AF('F', 1, ANALOG)

/* QSPI_CSN */
#define QSPI_CSN_PA2 \
	GD32_PINMUX_AF('A', 2, AF10)
#define QSPI_CSN_PB11 \
	GD32_PINMUX_AF('B', 11, AF10)
#define QSPI_CSN_PD3 \
	GD32_PINMUX_AF('D', 3, AF10)
#define QSPI_CSN_PE11 \
	GD32_PINMUX_AF('E', 11, AF10)

/* QSPI_DQS */
#define QSPI_DQS_PB7 \
	GD32_PINMUX_AF('B', 7, AF9)
#define QSPI_DQS_PD1 \
	GD32_PINMUX_AF('D', 1, AF10)

/* QSPI_IO0 */
#define QSPI_IO0_PB1 \
	GD32_PINMUX_AF('B', 1, AF10)
#define QSPI_IO0_PC1 \
	GD32_PINMUX_AF('C', 1, AF10)
#define QSPI_IO0_PD4 \
	GD32_PINMUX_AF('D', 4, AF10)
#define QSPI_IO0_PE12 \
	GD32_PINMUX_AF('E', 12, AF10)
#define QSPI_IO0_PF8 \
	GD32_PINMUX_AF('F', 8, AF10)

/* QSPI_IO1 */
#define QSPI_IO1_PB0 \
	GD32_PINMUX_AF('B', 0, AF10)
#define QSPI_IO1_PB2 \
	GD32_PINMUX_AF('B', 2, AF10)
#define QSPI_IO1_PC2 \
	GD32_PINMUX_AF('C', 2, AF10)
#define QSPI_IO1_PD5 \
	GD32_PINMUX_AF('D', 5, AF10)
#define QSPI_IO1_PE13 \
	GD32_PINMUX_AF('E', 13, AF10)
#define QSPI_IO1_PF9 \
	GD32_PINMUX_AF('F', 9, AF10)

/* QSPI_IO2 */
#define QSPI_IO2_PA7 \
	GD32_PINMUX_AF('A', 7, AF10)
#define QSPI_IO2_PC3 \
	GD32_PINMUX_AF('C', 3, AF10)
#define QSPI_IO2_PD6 \
	GD32_PINMUX_AF('D', 6, AF10)
#define QSPI_IO2_PE14 \
	GD32_PINMUX_AF('E', 14, AF10)
#define QSPI_IO2_PF7 \
	GD32_PINMUX_AF('F', 7, AF10)

/* QSPI_IO3 */
#define QSPI_IO3_PA6 \
	GD32_PINMUX_AF('A', 6, AF10)
#define QSPI_IO3_PC4 \
	GD32_PINMUX_AF('C', 4, AF10)
#define QSPI_IO3_PD7 \
	GD32_PINMUX_AF('D', 7, AF10)
#define QSPI_IO3_PE15 \
	GD32_PINMUX_AF('E', 15, AF10)
#define QSPI_IO3_PF6 \
	GD32_PINMUX_AF('F', 6, AF10)

/* QSPI_SCK */
#define QSPI_SCK_PA3 \
	GD32_PINMUX_AF('A', 3, AF10)
#define QSPI_SCK_PB10 \
	GD32_PINMUX_AF('B', 10, AF10)
#define QSPI_SCK_PD2 \
	GD32_PINMUX_AF('D', 2, AF10)
#define QSPI_SCK_PE10 \
	GD32_PINMUX_AF('E', 10, AF10)
#define QSPI_SCK_PF10 \
	GD32_PINMUX_AF('F', 10, AF10)

/* RTC_OUT0 */
#define RTC_OUT0_PC13 \
	GD32_PINMUX_AF('C', 13, ANALOG)

/* RTC_OUT1 */
#define RTC_OUT1_PB2 \
	GD32_PINMUX_AF('B', 2, AF0)

/* RTC_REFIN */
#define RTC_REFIN_PA1 \
	GD32_PINMUX_AF('A', 1, AF0)
#define RTC_REFIN_PB15 \
	GD32_PINMUX_AF('B', 15, AF0)

/* RTC_TAMP0 */
#define RTC_TAMP0_PC13 \
	GD32_PINMUX_AF('C', 13, ANALOG)

/* RTC_TAMP1 */
#define RTC_TAMP1_PA0 \
	GD32_PINMUX_AF('A', 0, ANALOG)

/* RTC_TAMP2 */
#define RTC_TAMP2_PE6 \
	GD32_PINMUX_AF('E', 6, ANALOG)

/* RTC_TS */
#define RTC_TS_PC13 \
	GD32_PINMUX_AF('C', 13, ANALOG)

/* SPI0_IO2 */
#define SPI0_IO2_PD14 \
	GD32_PINMUX_AF('D', 14, AF5)
#define SPI0_IO2_PE9 \
	GD32_PINMUX_AF('E', 9, AF5)

/* SPI0_IO3 */
#define SPI0_IO3_PD15 \
	GD32_PINMUX_AF('D', 15, AF5)
#define SPI0_IO3_PE10 \
	GD32_PINMUX_AF('E', 10, AF5)

/* SPI0_MISO */
#define SPI0_MISO_PA6 \
	GD32_PINMUX_AF('A', 6, AF5)
#define SPI0_MISO_PB4 \
	GD32_PINMUX_AF('B', 4, AF5)
#define SPI0_MISO_PG3 \
	GD32_PINMUX_AF('G', 3, AF5)

/* SPI0_MOSI */
#define SPI0_MOSI_PA7 \
	GD32_PINMUX_AF('A', 7, AF5)
#define SPI0_MOSI_PB5 \
	GD32_PINMUX_AF('B', 5, AF5)
#define SPI0_MOSI_PG4 \
	GD32_PINMUX_AF('G', 4, AF5)

/* SPI0_NSS */
#define SPI0_NSS_PA4 \
	GD32_PINMUX_AF('A', 4, AF5)
#define SPI0_NSS_PA15 \
	GD32_PINMUX_AF('A', 15, AF5)
#define SPI0_NSS_PG5 \
	GD32_PINMUX_AF('G', 5, AF5)

/* SPI0_SCK */
#define SPI0_SCK_PA5 \
	GD32_PINMUX_AF('A', 5, AF5)
#define SPI0_SCK_PB3 \
	GD32_PINMUX_AF('B', 3, AF5)
#define SPI0_SCK_PG2 \
	GD32_PINMUX_AF('G', 2, AF5)

/* SPI1_MISO */
#define SPI1_MISO_PA10 \
	GD32_PINMUX_AF('A', 10, AF5)
#define SPI1_MISO_PB14 \
	GD32_PINMUX_AF('B', 14, AF5)

/* SPI1_MOSI */
#define SPI1_MOSI_PA11 \
	GD32_PINMUX_AF('A', 11, AF5)
#define SPI1_MOSI_PB15 \
	GD32_PINMUX_AF('B', 15, AF5)

