GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32g5x3q(e)xx-pinctrl.h
/* TIMER19_CH1 */
#define TIMER19_CH1_PC2 \
	GD32_PINMUX_AF('C', 2, AF6)
#define TIMER19_CH1_PE3 \
	GD32_PINMUX_AF('E', 3, AF6)
#define TIMER19_CH1_PF13 \
	GD32_PINMUX_AF('F', 13, AF2)

/* TIMER19_CH2 */
#define TIMER19_CH2_PC8 \
	GD32_PINMUX_AF('C', 8, AF6)
#define TIMER19_CH2_PF2 \
	GD32_PINMUX_AF('F', 2, AF2)
#define TIMER19_CH2_PF14 \
	GD32_PINMUX_AF('F', 14, AF2)

/* TIMER19_CH3 */
#define TIMER19_CH3_PE1 \
	GD32_PINMUX_AF('E', 1, AF6)
#define TIMER19_CH3_PF3 \
	GD32_PINMUX_AF('F', 3, AF2)
#define TIMER19_CH3_PF15 \
	GD32_PINMUX_AF('F', 15, AF2)

/* TIMER19_ETI */
#define TIMER19_ETI_PE0 \
	GD32_PINMUX_AF('E', 0, AF6)
#define TIMER19_ETI_PF11 \
	GD32_PINMUX_AF('F', 11, AF2)
#define TIMER19_ETI_PG5 \
	GD32_PINMUX_AF('G', 5, AF2)

/* TIMER19_MCH0 */
#define TIMER19_MCH0_PB1 \
	GD32_PINMUX_AF('B', 1, AF7)
#define TIMER19_MCH0_PE4 \
	GD32_PINMUX_AF('E', 4, AF6)
#define TIMER19_MCH0_PF4 \
	GD32_PINMUX_AF('F', 4, AF3)
#define TIMER19_MCH0_PG0 \
	GD32_PINMUX_AF('G', 0, AF2)

/* TIMER19_MCH1 */
#define TIMER19_MCH1_PE5 \
	GD32_PINMUX_AF('E', 5, AF6)
#define TIMER19_MCH1_PF5 \
	GD32_PINMUX_AF('F', 5, AF2)
#define TIMER19_MCH1_PG1 \
	GD32_PINMUX_AF('G', 1, AF2)

/* TIMER19_MCH2 */
#define TIMER19_MCH2_PE6 \
	GD32_PINMUX_AF('E', 6, AF6)
#define TIMER19_MCH2_PG2 \
	GD32_PINMUX_AF('G', 2, AF2)

/* TIMER19_MCH3 */
#define TIMER19_MCH3_PE0 \
	GD32_PINMUX_AF('E', 0, AF3)
#define TIMER19_MCH3_PG3 \
	GD32_PINMUX_AF('G', 3, AF6)

/* TIMER1_CH0 */
#define TIMER1_CH0_PA0 \
	GD32_PINMUX_AF('A', 0, AF1)
#define TIMER1_CH0_PA5 \
	GD32_PINMUX_AF('A', 5, AF1)
#define TIMER1_CH0_PA15 \
	GD32_PINMUX_AF('A', 15, AF1)
#define TIMER1_CH0_PD3 \
	GD32_PINMUX_AF('D', 3, AF2)

/* TIMER1_CH1 */
#define TIMER1_CH1_PA1 \
	GD32_PINMUX_AF('A', 1, AF1)
#define TIMER1_CH1_PB3 \
	GD32_PINMUX_AF('B', 3, AF1)
#define TIMER1_CH1_PD4 \
	GD32_PINMUX_AF('D', 4, AF2)

/* TIMER1_CH2 */
#define TIMER1_CH2_PA2 \
	GD32_PINMUX_AF('A', 2, AF1)
#define TIMER1_CH2_PA9 \
	GD32_PINMUX_AF('A', 9, AF10)
#define TIMER1_CH2_PB10 \
	GD32_PINMUX_AF('B', 10, AF1)
#define TIMER1_CH2_PD7 \
	GD32_PINMUX_AF('D', 7, AF2)

/* TIMER1_CH3 */
#define TIMER1_CH3_PA3 \
	GD32_PINMUX_AF('A', 3, AF1)
#define TIMER1_CH3_PA10 \
	GD32_PINMUX_AF('A', 10, AF10)
#define TIMER1_CH3_PB11 \
	GD32_PINMUX_AF('B', 11, AF1)
#define TIMER1_CH3_PD6 \
	GD32_PINMUX_AF('D', 6, AF2)

/* TIMER1_ETI */
#define TIMER1_ETI_PA0 \
	GD32_PINMUX_AF('A', 0, AF14)
#define TIMER1_ETI_PA5 \
	GD32_PINMUX_AF('A', 5, AF1)
#define TIMER1_ETI_PA15 \
	GD32_PINMUX_AF('A', 15, AF14)
#define TIMER1_ETI_PD3 \
	GD32_PINMUX_AF('D', 3, AF2)

/* TIMER2_CH0 */
#define TIMER2_CH0_PA6 \
	GD32_PINMUX_AF('A', 6, AF2)
#define TIMER2_CH0_PB4 \
	GD32_PINMUX_AF('B', 4, AF2)
#define TIMER2_CH0_PC6 \
	GD32_PINMUX_AF('C', 6, AF2)
#define TIMER2_CH0_PE2 \
	GD32_PINMUX_AF('E', 2, AF2)

/* TIMER2_CH1 */
#define TIMER2_CH1_PA4 \
	GD32_PINMUX_AF('A', 4, AF2)
#define TIMER2_CH1_PA7 \
	GD32_PINMUX_AF('A', 7, AF2)
#define TIMER2_CH1_PB5 \
	GD32_PINMUX_AF('B', 5, AF2)
#define TIMER2_CH1_PC7 \
	GD32_PINMUX_AF('C', 7, AF2)
#define TIMER2_CH1_PE3 \
	GD32_PINMUX_AF('E', 3, AF2)

/* TIMER2_CH2 */
#define TIMER2_CH2_PB0 \
	GD32_PINMUX_AF('B', 0, AF2)
#define TIMER2_CH2_PC8 \
	GD32_PINMUX_AF('C', 8, AF2)
#define TIMER2_CH2_PE4 \
	GD32_PINMUX_AF('E', 4, AF2)

/* TIMER2_CH3 */
#define TIMER2_CH3_PB1 \
	GD32_PINMUX_AF('B', 1, AF2)
#define TIMER2_CH3_PB7 \
	GD32_PINMUX_AF('B', 7, AF10)
#define TIMER2_CH3_PC9 \
	GD32_PINMUX_AF('C', 9, AF2)
#define TIMER2_CH3_PE5 \
	GD32_PINMUX_AF('E', 5, AF2)

/* TIMER2_ETI */
#define TIMER2_ETI_PB3 \
	GD32_PINMUX_AF('B', 3, AF10)
#define TIMER2_ETI_PD2 \
	GD32_PINMUX_AF('D', 2, AF2)

/* TIMER3_CH0 */
#define TIMER3_CH0_PA11 \
	GD32_PINMUX_AF('A', 11, AF10)
#define TIMER3_CH0_PB6 \
	GD32_PINMUX_AF('B', 6, AF2)
#define TIMER3_CH0_PD12 \
	GD32_PINMUX_AF('D', 12, AF2)

/* TIMER3_CH1 */
#define TIMER3_CH1_PA12 \
	GD32_PINMUX_AF('A', 12, AF10)
#define TIMER3_CH1_PB7 \
	GD32_PINMUX_AF('B', 7, AF2)
#define TIMER3_CH1_PD13 \
	GD32_PINMUX_AF('D', 13, AF2)

/* TIMER3_CH2 */
#define TIMER3_CH2_PA13 \
	GD32_PINMUX_AF('A', 13, AF10)
#define TIMER3_CH2_PB8 \
	GD32_PINMUX_AF('B', 8, AF2)
#define TIMER3_CH2_PD14 \
	GD32_PINMUX_AF('D', 14, AF2)

/* TIMER3_CH3 */
#define TIMER3_CH3_PB9 \
	GD32_PINMUX_AF('B', 9, AF2)
#define TIMER3_CH3_PD15 \
	GD32_PINMUX_AF('D', 15, AF2)
#define TIMER3_CH3_PF6 \
	GD32_PINMUX_AF('F', 6, AF2)

/* TIMER3_ETI */
#define TIMER3_ETI_PA8 \
	GD32_PINMUX_AF('A', 8, AF10)
#define TIMER3_ETI_PB3 \
	GD32_PINMUX_AF('B', 3, AF2)
#define TIMER3_ETI_PE0 \
	GD32_PINMUX_AF('E', 0, AF2)

/* TIMER4_CH0 */
#define TIMER4_CH0_PA0 \
	GD32_PINMUX_AF('A', 0, AF2)
#define TIMER4_CH0_PB2 \
	GD32_PINMUX_AF('B', 2, AF2)
#define TIMER4_CH0_PF6 \
	GD32_PINMUX_AF('F', 6, AF6)

/* TIMER4_CH1 */
#define TIMER4_CH1_PA1 \
	GD32_PINMUX_AF('A', 1, AF2)
#define TIMER4_CH1_PC12 \
	GD32_PINMUX_AF('C', 12, AF1)
#define TIMER4_CH1_PF7 \
	GD32_PINMUX_AF('F', 7, AF6)
#define TIMER4_CH1_PF8 \
	GD32_PINMUX_AF('F', 8, AF6)

/* TIMER4_CH2 */
#define TIMER4_CH2_PA2 \
	GD32_PINMUX_AF('A', 2, AF2)
#define TIMER4_CH2_PE8 \
	GD32_PINMUX_AF('E', 8, AF1)

/* TIMER4_CH3 */
#define TIMER4_CH3_PA3 \
	GD32_PINMUX_AF('A', 3, AF2)
#define TIMER4_CH3_PE9 \
	GD32_PINMUX_AF('E', 9, AF1)
#define TIMER4_CH3_PF9 \
	GD32_PINMUX_AF('F', 9, AF6)

/* TIMER4_ETI */
#define TIMER4_ETI_PB12 \
	GD32_PINMUX_AF('B', 12, AF2)
#define TIMER4_ETI_PD11 \
	GD32_PINMUX_AF('D', 11, AF1)
#define TIMER4_ETI_PF6 \
	GD32_PINMUX_AF('F', 6, AF1)

/* TIMER7_BRKIN0 */
#define TIMER7_BRKIN0_PA0 \
	GD32_PINMUX_AF('A', 0, AF9)
#define TIMER7_BRKIN0_PA6 \
	GD32_PINMUX_AF('A', 6, AF4)
#define TIMER7_BRKIN0_PA10 \
	GD32_PINMUX_AF('A', 10, AF11)
#define TIMER7_BRKIN0_PB7 \
	GD32_PINMUX_AF('B', 7, AF5)
#define TIMER7_BRKIN0_PD2 \
	GD32_PINMUX_AF('D', 2, AF4)

/* TIMER7_BRKIN1 */
#define TIMER7_BRKIN1_PA13 \
	GD32_PINMUX_AF('A', 13, AF6)
#define TIMER7_BRKIN1_PG4 \
	GD32_PINMUX_AF('G', 4, AF3)
#define TIMER7_BRKIN1_PG9 \
	GD32_PINMUX_AF('G', 9, AF3)

/* TIMER7_BRKIN2 */
#define TIMER7_BRKIN2_PB6 \
	GD32_PINMUX_AF('B', 6, AF10)
#define TIMER7_BRKIN2_PC9 \
	GD32_PINMUX_AF('C', 9, AF6)
#define TIMER7_BRKIN2_PD1 \
	GD32_PINMUX_AF('D', 1, AF6)

