GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32g5x3q(e)xx-pinctrl.h
/* TIMER7_CH0 */
#define TIMER7_CH0_PA15 \
	GD32_PINMUX_AF('A', 15, AF3)
#define TIMER7_CH0_PB6 \
	GD32_PINMUX_AF('B', 6, AF5)
#define TIMER7_CH0_PC6 \
	GD32_PINMUX_AF('C', 6, AF4)

/* TIMER7_CH1 */
#define TIMER7_CH1_PA14 \
	GD32_PINMUX_AF('A', 14, AF6)
#define TIMER7_CH1_PB8 \
	GD32_PINMUX_AF('B', 8, AF10)
#define TIMER7_CH1_PC7 \
	GD32_PINMUX_AF('C', 7, AF4)

/* TIMER7_CH2 */
#define TIMER7_CH2_PB9 \
	GD32_PINMUX_AF('B', 9, AF10)
#define TIMER7_CH2_PC8 \
	GD32_PINMUX_AF('C', 8, AF4)

/* TIMER7_CH3 */
#define TIMER7_CH3_PC9 \
	GD32_PINMUX_AF('C', 9, AF4)
#define TIMER7_CH3_PD1 \
	GD32_PINMUX_AF('D', 1, AF4)

/* TIMER7_ETI */
#define TIMER7_ETI_PA0 \
	GD32_PINMUX_AF('A', 0, AF10)
#define TIMER7_ETI_PB6 \
	GD32_PINMUX_AF('B', 6, AF6)

/* TIMER7_MCH0 */
#define TIMER7_MCH0_PA7 \
	GD32_PINMUX_AF('A', 7, AF4)
#define TIMER7_MCH0_PB3 \
	GD32_PINMUX_AF('B', 3, AF4)
#define TIMER7_MCH0_PC10 \
	GD32_PINMUX_AF('C', 10, AF4)

/* TIMER7_MCH1 */
#define TIMER7_MCH1_PB0 \
	GD32_PINMUX_AF('B', 0, AF4)
#define TIMER7_MCH1_PB4 \
	GD32_PINMUX_AF('B', 4, AF4)
#define TIMER7_MCH1_PC11 \
	GD32_PINMUX_AF('C', 11, AF4)

/* TIMER7_MCH2 */
#define TIMER7_MCH2_PB1 \
	GD32_PINMUX_AF('B', 1, AF4)
#define TIMER7_MCH2_PB5 \
	GD32_PINMUX_AF('B', 5, AF3)
#define TIMER7_MCH2_PC12 \
	GD32_PINMUX_AF('C', 12, AF4)

/* TIMER7_MCH3 */
#define TIMER7_MCH3_PC13 \
	GD32_PINMUX_AF('C', 13, AF6)
#define TIMER7_MCH3_PD0 \
	GD32_PINMUX_AF('D', 0, AF6)

/* TRIGSEL_IN0 */
#define TRIGSEL_IN0_PA0 \
	GD32_PINMUX_AF('A', 0, AF13)

/* TRIGSEL_IN1 */
#define TRIGSEL_IN1_PA1 \
	GD32_PINMUX_AF('A', 1, AF13)

/* TRIGSEL_IN10 */
#define TRIGSEL_IN10_PA13 \
	GD32_PINMUX_AF('A', 13, AF13)

/* TRIGSEL_IN11 */
#define TRIGSEL_IN11_PA14 \
	GD32_PINMUX_AF('A', 14, AF13)

/* TRIGSEL_IN12 */
#define TRIGSEL_IN12_PA10 \
	GD32_PINMUX_AF('A', 10, AF14)
#define TRIGSEL_IN12_PA12 \
	GD32_PINMUX_AF('A', 12, AF13)

/* TRIGSEL_IN13 */
#define TRIGSEL_IN13_PA9 \
	GD32_PINMUX_AF('A', 9, AF14)
#define TRIGSEL_IN13_PA11 \
	GD32_PINMUX_AF('A', 11, AF13)

/* TRIGSEL_IN2 */
#define TRIGSEL_IN2_PC2 \
	GD32_PINMUX_AF('C', 2, AF13)

/* TRIGSEL_IN3 */
#define TRIGSEL_IN3_PD0 \
	GD32_PINMUX_AF('D', 0, AF13)

/* TRIGSEL_IN4 */
#define TRIGSEL_IN4_PA3 \
	GD32_PINMUX_AF('A', 3, AF13)

/* TRIGSEL_IN5 */
#define TRIGSEL_IN5_PA7 \
	GD32_PINMUX_AF('A', 7, AF13)

/* TRIGSEL_IN6 */
#define TRIGSEL_IN6_PD1 \
	GD32_PINMUX_AF('D', 1, AF13)

/* TRIGSEL_IN7 */
#define TRIGSEL_IN7_PA2 \
	GD32_PINMUX_AF('A', 2, AF13)

/* TRIGSEL_IN8 */
#define TRIGSEL_IN8_PC0 \
	GD32_PINMUX_AF('C', 0, AF13)

/* TRIGSEL_IN9 */
#define TRIGSEL_IN9_PC1 \
	GD32_PINMUX_AF('C', 1, AF13)

/* TRIGSEL_OUT0 */
#define TRIGSEL_OUT0_PA15 \
	GD32_PINMUX_AF('A', 15, AF12)

/* TRIGSEL_OUT1 */
#define TRIGSEL_OUT1_PB14 \
	GD32_PINMUX_AF('B', 14, AF14)
#define TRIGSEL_OUT1_PF4 \
	GD32_PINMUX_AF('F', 4, AF13)

/* TRIGSEL_OUT2 */
#define TRIGSEL_OUT2_PB10 \
	GD32_PINMUX_AF('B', 10, AF14)

/* TRIGSEL_OUT3 */
#define TRIGSEL_OUT3_PB0 \
	GD32_PINMUX_AF('B', 0, AF12)

/* TRIGSEL_OUT4 */
#define TRIGSEL_OUT4_PB1 \
	GD32_PINMUX_AF('B', 1, AF12)

/* TRIGSEL_OUT5 */
#define TRIGSEL_OUT5_PB15 \
	GD32_PINMUX_AF('B', 15, AF14)
#define TRIGSEL_OUT5_PF5 \
	GD32_PINMUX_AF('F', 5, AF13)

/* TRIGSEL_OUT6 */
#define TRIGSEL_OUT6_PB4 \
	GD32_PINMUX_AF('B', 4, AF14)

/* TRIGSEL_OUT7 */
#define TRIGSEL_OUT7_PB3 \
	GD32_PINMUX_AF('B', 3, AF13)

/* UART3_CTS */
#define UART3_CTS_PB7 \
	GD32_PINMUX_AF('B', 7, AF14)

/* UART3_DE */
#define UART3_DE_PA15 \
	GD32_PINMUX_AF('A', 15, AF8)

/* UART3_RTS */
#define UART3_RTS_PA15 \
	GD32_PINMUX_AF('A', 15, AF8)

/* UART3_RX */
#define UART3_RX_PA1 \
	GD32_PINMUX_AF('A', 1, AF6)
#define UART3_RX_PC11 \
	GD32_PINMUX_AF('C', 11, AF5)

/* UART3_TX */
#define UART3_TX_PA0 \
	GD32_PINMUX_AF('A', 0, AF6)
#define UART3_TX_PC10 \
	GD32_PINMUX_AF('C', 10, AF5)

/* UART4_CTS */
#define UART4_CTS_PB5 \
	GD32_PINMUX_AF('B', 5, AF14)

/* UART4_DE */
#define UART4_DE_PB4 \
	GD32_PINMUX_AF('B', 4, AF8)

/* UART4_RTS */
#define UART4_RTS_PB4 \
	GD32_PINMUX_AF('B', 4, AF8)

/* UART4_RX */
#define UART4_RX_PA8 \
	GD32_PINMUX_AF('A', 8, AF14)
#define UART4_RX_PD2 \
	GD32_PINMUX_AF('D', 2, AF5)

/* UART4_TX */
#define UART4_TX_PA7 \
	GD32_PINMUX_AF('A', 7, AF14)
#define UART4_TX_PC12 \
	GD32_PINMUX_AF('C', 12, AF5)

/* USART0_CK */
#define USART0_CK_PA8 \
	GD32_PINMUX_AF('A', 8, AF7)

/* USART0_CTS */
#define USART0_CTS_PA11 \
	GD32_PINMUX_AF('A', 11, AF7)

/* USART0_DE */
#define USART0_DE_PA12 \
	GD32_PINMUX_AF('A', 12, AF7)
#define USART0_DE_PF10 \
	GD32_PINMUX_AF('F', 10, AF14)

/* USART0_RTS */
#define USART0_RTS_PA12 \
	GD32_PINMUX_AF('A', 12, AF7)
#define USART0_RTS_PF10 \
	GD32_PINMUX_AF('F', 10, AF14)

/* USART0_RX */
#define USART0_RX_PA10 \
	GD32_PINMUX_AF('A', 10, AF7)
#define USART0_RX_PB7 \
	GD32_PINMUX_AF('B', 7, AF7)
#define USART0_RX_PC5 \
	GD32_PINMUX_AF('C', 5, AF7)
#define USART0_RX_PE1 \
	GD32_PINMUX_AF('E', 1, AF7)

/* USART0_TX */
#define USART0_TX_PA9 \
	GD32_PINMUX_AF('A', 9, AF7)
#define USART0_TX_PB6 \
	GD32_PINMUX_AF('B', 6, AF7)
#define USART0_TX_PC4 \
	GD32_PINMUX_AF('C', 4, AF7)
#define USART0_TX_PE0 \
	GD32_PINMUX_AF('E', 0, AF7)
#define USART0_TX_PG9 \
	GD32_PINMUX_AF('G', 9, AF7)

/* USART1_CK */
#define USART1_CK_PA4 \
	GD32_PINMUX_AF('A', 4, AF7)
#define USART1_CK_PB5 \
	GD32_PINMUX_AF('B', 5, AF7)
#define USART1_CK_PD7 \
	GD32_PINMUX_AF('D', 7, AF7)

/* USART1_CTS */
#define USART1_CTS_PA0 \
	GD32_PINMUX_AF('A', 0, AF7)
#define USART1_CTS_PD3 \
	GD32_PINMUX_AF('D', 3, AF7)

/* USART1_DE */
#define USART1_DE_PA1 \
	GD32_PINMUX_AF('A', 1, AF7)
#define USART1_DE_PD4 \
	GD32_PINMUX_AF('D', 4, AF7)

/* USART1_RTS */
#define USART1_RTS_PA1 \
	GD32_PINMUX_AF('A', 1, AF7)
#define USART1_RTS_PD4 \
	GD32_PINMUX_AF('D', 4, AF7)

/* USART1_RX */
#define USART1_RX_PA3 \
	GD32_PINMUX_AF('A', 3, AF7)
#define USART1_RX_PA15 \
	GD32_PINMUX_AF('A', 15, AF7)
#define USART1_RX_PB4 \
	GD32_PINMUX_AF('B', 4, AF7)
#define USART1_RX_PD6 \
	GD32_PINMUX_AF('D', 6, AF7)

/* USART1_TX */
#define USART1_TX_PA2 \
	GD32_PINMUX_AF('A', 2, AF7)
#define USART1_TX_PA14 \
	GD32_PINMUX_AF('A', 14, AF7)
#define USART1_TX_PB3 \
	GD32_PINMUX_AF('B', 3, AF7)
#define USART1_TX_PD5 \
	GD32_PINMUX_AF('D', 5, AF7)

