GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32g5x3q(e)xx-pinctrl.h
/* USART2_CK */
#define USART2_CK_PB12 \
	GD32_PINMUX_AF('B', 12, AF7)
#define USART2_CK_PC12 \
	GD32_PINMUX_AF('C', 12, AF7)
#define USART2_CK_PD10 \
	GD32_PINMUX_AF('D', 10, AF7)

/* USART2_CTS */
#define USART2_CTS_PA13 \
	GD32_PINMUX_AF('A', 13, AF7)
#define USART2_CTS_PB13 \
	GD32_PINMUX_AF('B', 13, AF7)
#define USART2_CTS_PD11 \
	GD32_PINMUX_AF('D', 11, AF7)

/* USART2_DE */
#define USART2_DE_PB14 \
	GD32_PINMUX_AF('B', 14, AF7)
#define USART2_DE_PD12 \
	GD32_PINMUX_AF('D', 12, AF7)
#define USART2_DE_PF6 \
	GD32_PINMUX_AF('F', 6, AF7)

/* USART2_RTS */
#define USART2_RTS_PB14 \
	GD32_PINMUX_AF('B', 14, AF7)
#define USART2_RTS_PD12 \
	GD32_PINMUX_AF('D', 12, AF7)
#define USART2_RTS_PF6 \
	GD32_PINMUX_AF('F', 6, AF7)

/* USART2_RX */
#define USART2_RX_PA6 \
	GD32_PINMUX_AF('A', 6, AF7)
#define USART2_RX_PB8 \
	GD32_PINMUX_AF('B', 8, AF7)
#define USART2_RX_PB11 \
	GD32_PINMUX_AF('B', 11, AF7)
#define USART2_RX_PC11 \
	GD32_PINMUX_AF('C', 11, AF7)
#define USART2_RX_PD9 \
	GD32_PINMUX_AF('D', 9, AF7)
#define USART2_RX_PE15 \
	GD32_PINMUX_AF('E', 15, AF7)

/* USART2_TX */
#define USART2_TX_PA5 \
	GD32_PINMUX_AF('A', 5, AF7)
#define USART2_TX_PB9 \
	GD32_PINMUX_AF('B', 9, AF7)
#define USART2_TX_PB10 \
	GD32_PINMUX_AF('B', 10, AF7)
#define USART2_TX_PC10 \
	GD32_PINMUX_AF('C', 10, AF7)
#define USART2_TX_PD8 \
	GD32_PINMUX_AF('D', 8, AF7)

/* WKUP0 */
#define WKUP0_PA0 \
	GD32_PINMUX_AF('A', 0, ANALOG)

/* WKUP1 */
#define WKUP1_PC13 \
	GD32_PINMUX_AF('C', 13, ANALOG)

/* WKUP2 */
#define WKUP2_PE6 \
	GD32_PINMUX_AF('E', 6, ANALOG)

/* WKUP3 */
#define WKUP3_PA2 \
	GD32_PINMUX_AF('A', 2, ANALOG)

/* WKUP4 */
#define WKUP4_PC5 \
	GD32_PINMUX_AF('C', 5, ANALOG)
